app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists" ORDER BY title asc
---
  def index
    @todo_lists = TodoList.all

UPDATE "todo_lists" SET "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["description", "Milk, Bread"], ["updated_at", "2018-10-04 20:18:34.378040"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)